In [ ]:
import pandas as pd

### Import CSV-datei

In [7]:
import pandas as pd
import io
import requests

url = "https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv"
s = requests.get(url).content
df = pd.read_csv(io.StringIO(s.decode('utf-8')))
df.head()

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### Basic information as rows, columns and some basic statistical info

In [13]:
df['BIP']

0    3466
1    4938
2    1529
3    1850
4    1798
Name: BIP, dtype: int64

In [14]:
df[['BIP']]

    BIP
0  3466
1  4938
2  1529
3  1850
4  1798

In [15]:
df[0:5:2]

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
2    Canada   36503097  9984670  1529      CAD
4  Brazilia  208360000  8515770  1798     REAL

In [16]:
df[::-1]

       Name     People     Area   BIP Currency
4  Brazilia  208360000  8515770  1798     REAL
3     Italy   60501718   301338  1850      EUR
2    Canada   36503097  9984670  1529      CAD
1     Japan  126045000   377835  4938      YEN
0   Germany   82521653   357385  3466      EUR

In [28]:
df.describe()

             People          Area         Bip
count  5.000000e+00  5.000000e+00     5.00000
mean   1.027863e+08  3.907400e+06  2716.20000
std    6.759970e+07  4.904957e+06  1457.86083
min    3.650310e+07  3.013380e+05  1529.00000
25%    6.050172e+07  3.573850e+05  1798.00000
50%    8.252165e+07  3.778350e+05  1850.00000
75%    1.260450e+08  8.515770e+06  3466.00000
max    2.083600e+08  9.984670e+06  4938.00000

### Show the last 4 row

In [18]:
df.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### All countries who have the EURO

In [21]:
df.loc[df['Currency']=='EUR']

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

### Only name and currency in a new data frame

In [24]:
df[['Name', 'Currency']]

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

### Only the rows/countries that have more than 2000 BIP

In [26]:
df.loc[df['BIP']>2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

### All countries with inhabitants between 50 and 150 Mio

In [34]:
df.loc[(df['People']>50000000) & (df['People']<150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

### Change BIP to Bip

In [19]:
df.rename(columns={'BIP': 'Bip'}, inplace=True)
df.head()

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### Calculate the Bip sum

In [21]:
df['Bip'].sum()

13581

### Calculate the average people of all countries

In [25]:
df['People'].mean()

102786293.6

### Sort by name alphabetically

In [27]:
df.sort_values('Name')

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

### Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!

In [31]:
import numpy as np
df_area_cat = df.copy()
df_area_cat['Area'] = np.where(df_area_cat['Area'] <= 1000000, 'SMALL', 'BIG')
df_area_cat

       Name     People   Area   Bip Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL